# Задача 1. Создайте телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах.
# Предусмотрите следующие функции для справочника:
# - новая запись - сделал;
# - вывод всего справочника1 - сделал;
# - поиск по имени - еще нет;
# - экспорт справочника в форматы html, xml - сделал;
# - чтение данных из файла - сделал;
# Требуется реализовать минимум 3 инструмента для работы со справочником.

import controller

def StartController():
    controller.start()

StartController()